;==========================================================
; NEW TECHS -----------------------------------------------
;==========================================================
[SuperiorExplosives X2TechTemplate]
DisplayName="Superior Explosives"
Summary="We've managed to further improve our explosive weapons system, surpassing the power of the alien's own weaponry. This technological breakthrough will definitely tip the scales in our favor in the upcoming battles."

;==========================================================
; NEW ITEMS -----------------------------------------------
;==========================================================
[AcidGrenadeMk3 X2GrenadeTemplate]
FriendlyName="Acid Warhead"
FriendlyNamePlural="Acid Warheads"
BriefSummary="The chemical additive in the Acid Warhead is extremely corrosive, able to strip away most enemy armor immediately, while continuing to damage the target over time with chemical burns."
TacticalText="<Bullet/> Acid Warheads shred a massive amount of enemy armor, more than any other grenade.<br><Bullet/> Enemies burned by acid will take additional damage over multiple turns."
ThrownAbilityName="Throw Acid Warhead"
ThrownAbilityHelpText="Creates pools of acid that will damage units."
LaunchedAbilityname="Launch Acid Warhead"
LaunchedAbilityHelpText="Creates pools of acid that will damage units."

[EMPGrenadeMk3 X2GrenadeTemplate]
FriendlyName="EMP Warhead"
FriendlyNamePlural="EMP Warheads"
BriefSummary="EMP Warheads wreak havoc on the delicate electronic systems in mechanical and robotic enemies, dealing considerable damage and potentially rendering them inoperable for a short period of time. Organic enemies are completely immune to these effects, however."
TacticalText="<Bullet/> EMP Warheads deal massive damage in a large radius to mechanical enemies.<br><Bullet/> EMP Warheads ignore armor when dealing damage.<br><Bullet/> EMP Warheads can be thrown or launched considerably further than standard grenades."
ThrownAbilityName="Throw EMP Warhead"
ThrownAbilityHelpText="Damage and disorient mechanical units in the target area."
LaunchedAbilityname="Launch EMP Warhead"
LaunchedAbilityHelpText="Damage and disorient mechanical units in the target area."

[FlashbangGrenadeMk2 X2GrenadeTemplate]
FriendlyName="Flashbang Bomb"
FriendlyNamePlural="Flashbang Bombs"
BriefSummary="The upgraded Flashbang Bomb disrupts and disorients enemies in an even larger radius, inflicting significant offensive penalties."
TacticalText="<Bullet/> Flashbang Bombs don't do damage, but disorient and disrupt enemies in a large radius.<br><Bullet/> Friendly squad members will not be affected."
ThrownAbilityName="Throw Flashbang Bomb"
ThrownAbilityHelpText="Disorient all hostile targets in the affected area."
LaunchedAbilityname="Launch Flashbang Bomb"
LaunchedAbilityHelpText="Disorient all hostile targets in the affected area."

[FlashbangGrenadeMk3 X2GrenadeTemplate]
FriendlyName="Flashbang Warhead"
FriendlyNamePlural="Flashbang Warheads"
BriefSummary=The Flashbang Warhead disrupts and disorients enemies in a massive radius, inflicting significant offensive penalties."
TacticalText="<Bullet/> Flashbang Warheads don't do damage, but disorient and disrupt enemies in a large radius.<br><Bullet/> Friendly squad members will not be affected."
ThrownAbilityName="Throw Flashbang Warhead"
ThrownAbilityHelpText="Disorient all hostile targets in the affected area."
LaunchedAbilityname="Launch Flashbang Warhead"
LaunchedAbilityHelpText="Disorient all hostile targets in the affected area."

[GasGrenadeMk3 X2GrenadeTemplate]
FriendlyName="Gas Warhead"
FriendlyNamePlural="Gas Warheads"
BriefSummary="The toxin delivery system in the Gas Warhead extends the initial explosive radius even further, damaging all enemy targets and applying an additional poison effect to any organic enemies caught in the blast."
TacticalText="<Bullet/> Gas Warheads have a considerably larger radius than standard frag grenades.<br><Bullet/> Poison gas has a dramatic effect on organic enemies, slowing them and doing damage over time."
ThrownAbilityName="Throw Gas Warhead"
ThrownAbilityHelpText="After initial grenade blast, creates a cloud of gas that will poison any units within the cloud."
LaunchedAbilityname="Launch Gas Warhead"
LaunchedAbilityHelpText="After initial grenade blast, creates a cloud of gas that will poison any units within the cloud."

[FirebombMk3 X2GrenadeTemplate]
FriendlyName="Incendiary Warhead"
FriendlyNamePlural="Incendiary Warheads"
BriefSummary="The Incendiary Warhead not only deals a high amount of explosive damage to every target in its radius, but also sets most enemies and environments alight, subjecting them to greater burning damage over time."
TacticalText="<Bullet/> Incendiary Warheads will damage all units in the blast radius, and apply the \"burning\" effect to any units vulnerable to flame.\n<Bullet/> Incendiary Warheads do more blast damage than all other warheads.\n<Bullet/> Some enemies, particularly metallic ones, are immune to fire and will not suffer the \"burning\" effect."
ThrownAbilityName="Throw Incendiary Warhead"
ThrownAbilityHelpText="Sets fire to the target area, along with affected units."
LaunchedAbilityname="Launch Incendiary Warhead"
LaunchedAbilityHelpText="Sets fire to the target area, along with affected units."

[PlasmaGrenadeMk3 X2GrenadeTemplate]
FriendlyName="Plasma Warhead"
FriendlyNamePlural="Plasma Warheads"
BriefSummary=="The Plasma Warhead, an upgraded version of the Plasma Grenade, does greater damage and is more effective at shredding enemy armor."
TacticalText="<Bullet/> Plasma warheads improve on the plasma grenade's damage and armor shredding capabilities."
ThrownAbilityName="Throw Plasma Warhead"
ThrownAbilityHelpText="Throw a plasma warhead at target area. Shreds armor."
LaunchedAbilityname="Launch Plasma Warhead"
LaunchedAbilityHelpText="Launch a plasma warhead at target area. Shreds armor."

[ProximityMineMk2 X2GrenadeTemplate]
FriendlyName="Proximity Bomb"
FriendlyNamePlural="Proximity Bombs"
BriefSummary="The upgraded Proximity Bomb will self-trigger when an enemy penetrates its radius, dealing massive damage to the environment and enemy targets alike."
TacticalText="<Bullet/> Throwing a Proximity Bomb will not break a soldier's concealment.<br><Bullet/> Proximity Bombs are not triggered by friendly units, but if caught within the bomb's blast radius, friendly units will be damaged."
ThrownAbilityName="Throw Proximity Bomb"
ThrownAbilityHelpText="Throw a proximity bomb at target area."
LaunchedAbilityname="Launch Proximity Bomb"
LaunchedAbilityHelpText="Launch a proximity bomb at target area."

[ProximityMineMk3 X2GrenadeTemplate]
FriendlyName="Proximity Warhead"
FriendlyNamePlural="Proximity Warheads"
BriefSummary="Using high-tech multi spectrum sensors, the Proximity Warhead will self-trigger when an enemy penetrates its radius, dealing massive damage to the environment and enemy targets alike."
TacticalText="<Bullet/> Throwing a Proximity Warhead will not break a soldier's concealment.<br><Bullet/> Proximity Warheads are not triggered by friendly units, but if caught within the warhead's blast radius, friendly units will be damaged."
ThrownAbilityName="Throw Proximity Warhead"
ThrownAbilityHelpText="Throw a proximity warhead at target area."
LaunchedAbilityname="Launch Proximity Warhead"
LaunchedAbilityHelpText="Launch a proximity warhead at target area."

[SmokeGrenadeMk3 X2GrenadeTemplate]
FriendlyName="Smoke Warhead"
FriendlyNamePlural="Smoke Warheads"
BriefSummary="The Smoke Warhead provides a significant defensive boost to any unit within the radius of the smoke, friend or foe."
TacticalText="<Bullet/> Smoke Warheads, a powerful upgrade to our Smoke Bombs, grant extended smoke radius.<br><Bullet/> Smoke can be deployed to instantly increase the defense of nearby units.<br><Bullet/> Smoke Warheads can be thrown and launched significantly further than standard grenades."
ThrownAbilityName="Throw Smoke Warhead"
ThrownAbilityHelpText="Grants a significant defensive boost to units within its radius."
LaunchedAbilityname="Launch Smoke Warhead"
LaunchedAbilityHelpText="Grants a significant defensive boost to units within its radius."

;==========================================================
; VANILLA OVERRIDE ----------------------------------------
;==========================================================
[SmokeGrenadeMk2 X2GrenadeTemplate]
FriendlyName="Smoke Bomb"
FriendlyNamePlural="Smoke Bombs"
BriefSummary="The upgraded Smoke Bomb provides a significant defensive boost to any unit within the radius of the smoke, friend or foe."
TacticalText="<Bullet/> Smoke Bombs, a powerful upgrade to our earlier Smoke Grenades, grant extended smoke radius.<br><Bullet/> Smoke can be deployed to instantly increase the defense of nearby units.<br><Bullet/> Smoke Bombs can be thrown and launched significantly further than standard grenades."
ThrownAbilityName="Throw Smoke Bomb"
ThrownAbilityHelpText="Grants a significant defensive boost to units within its radius."
LaunchedAbilityname="Launch Smoke Bomb"
LaunchedAbilityHelpText="Grants a significant defensive boost to units within its radius."

